[
    {
        "id": 1,
        "companyLogo": "https://www.google.com/images/branding/googlelogo/1x/googlelogo_color_272x92dp.png",
        "companyName": "Google",
        "jobTitle": "Software Engineer",
        "jobDescription": "Google is looking for a Software Engineer to join our team. In this role, you will be responsible for developing and improving Google's core products and services.",
        "jobResponsibilities": "Design and implement new software features and products; work with other teams to develop and maintain APIs and integrations; collaborate with cross-functional teams to identify and solve complex problems.",
        "educationalRequirements": "Bachelor's or Master's degree in Computer Science, Electrical Engineering, or related technical field.",
        "experienceRequirements": "5+ years of experience developing software applications, with a focus on web applications and distributed systems.",
        "remote": true,
        "fullTime": true,
        "location": "Mountain View, CA",
        "salaryRange": "$120,000 - $180,000",
        "phone": "650-253-0000",
        "email": "jobs@google.com"
    },
    {
        "id": 2,
        "companyLogo": "https://www.apple.com/ac/structured-data/images/open_graph_logo.png?201809211614",
        "companyName": "Apple",
        "jobTitle": "Product Manager",
        "jobDescription": "Apple is looking for a Product Manager to join our team. In this role, you will be responsible for leading the development and launch of new products.",
        "jobResponsibilities": "Work with cross-functional teams to develop product vision and strategy; lead the end-to-end product development process, from concept to launch; analyze market and user data to identify opportunities for new products and features.",
        "educationalRequirements": "Bachelor's or Master's degree in Business Administration, Marketing, or a related field.",
        "experienceRequirements": "5+ years of experience in product management, with a focus on consumer products.",
        "onsite": true,
        "fullTime": true,
        "location": "Cupertino, CA",
        "salaryRange": "$150,000 - $200,000",
        "phone": "408-996-1010",
        "email": "jobs@apple.com"
    },
    {
        "id": 3,
        "companyLogo": "https://www.amazon.com/favicon.ico",
        "companyName": "Amazon",
        "jobTitle": "Data Scientist",
        "jobDescription": "Amazon is seeking a Data Scientist to join our team. In this role, you will be responsible for developing and implementing machine learning algorithms to drive business insights and decisions.",
        "jobResponsibilities": "Work with stakeholders to identify business problems and opportunities; design, implement, and validate machine learning models; present findings and recommendations to leadership.",
        "educationalRequirements": "Bachelor's or Master's degree in Computer Science, Statistics, Mathematics, or a related field.",
        "experienceRequirements": "3+ years of experience in data science, with a focus on machine learning.",
        "remote": true,
        "fullTime": true,
        "location": "Seattle, WA",
        "salaryRange": "$120,000 - $160,000",
        "phone": "206-266-1000",
        "email": "jobs@amazon.com"
    },
    {
        "id": 4,
        "companyLogo": "https://www.ibm.com/ibm/ginni/images/ginni_bio_780x981_v4_03162016.jpg",
        "companyName": "IBM",
        "jobTitle": "Artificial Intelligence Engineer",
        "jobDescription": "IBM is seeking an Artificial Intelligence Engineer to join our team. In this role, you will be responsible for developing and deploying AI models to solve business problems.",
        "jobResponsibilities": "Design and implement machine learning and deep learning models; work with stakeholders to identify use cases for AI in business; deploy and maintain models in production environments.",
        "educationalRequirements": "Bachelor's or Master's degree in Computer Science, Artificial Intelligence, or a related field.",
        "experienceRequirements": "3+ years of experience in developing and deploying machine learning and deep learning models.",
        "onsite": true,
        "fullTime": true,
        "location": "Remote",
        "salaryRange": "$130,000 - $180,000",
        "phone": "1-800-IBM-4YOU",
        "email": "jobs@ibm.com"
    },
    {
        "id": 5,
        "companyLogo": "https://www.facebook.com/images/fb_icon_325x325.png",
        "companyName": "Facebook",
        "jobTitle": "Data Analyst",
        "jobDescription": "Facebook is seeking a Data Analyst to join our team. In this role, you will be responsible for analyzing and interpreting data to provide insights that drive business decisions.",
        "jobResponsibilities": "Design and implement experiments to test hypotheses and evaluate product changes; work with stakeholders to develop metrics that align with business goals; communicate findings to technical and non-technical audiences.",
        "educationalRequirements": "Bachelor's or Master's degree in Computer Science, Statistics, Mathematics, or a related field.",
        "experienceRequirements": "3+ years of experience in data analysis, with a focus on experimentation and causal inference.",
        "remote": true,
        "fullTime": true,
        "location": "Remote",
        "salaryRange": "$120,000 - $150,000",
        "phone": "1-650-308-7300",
        "email": "jobs@facebook.com"
    },
    {
        "id": 6,
        "companyLogo": "https://www.microsoft.com/en-us/store/b/themes/microsoft/pdp-hero-logo.png",
        "companyName": "Microsoft",
        "jobTitle": "Software Development Engineer",
        "jobDescription": "Microsoft is seeking a Software Development Engineer to join our team. In this role, you will be responsible for developing and maintaining software products used by millions of users around the world.",
        "jobResponsibilities": "Collaborate with cross-functional teams to design, develop, and launch new features; write clean, efficient, and well-documented code; troubleshoot and debug issues reported by users.",
        "educationalRequirements": "Bachelor's or Master's degree in Computer Science or a related field.",
        "experienceRequirements": "3+ years of experience in software development, with a focus on building large-scale applications.",
        "onsite": false,
        "fullTime": true,
        "location": "Redmond, WA",
        "salaryRange": "$110,000 - $170,000",
        "phone": "1-800-642-7676",
        "email": "jobs@microsoft.com"
    }
]